src/history/history10/KBe20hist201retRoppLateQingSummary.org

#+AUTHOR: Exr0n
#+TITLE: Ropp Late Qing Summary
* Facts
** China was not aware of international powers
** Internal (rebellion) and external pressures were too much
** Internal power struggles (conservative vs radical) made it worse
* Claims
** The opium trade caused the other problems (106.1)
** By the 1900s, it was too late for the Qing dynasty
* Questions
** What happened to China's military?
